driver-tests/bpelse/assign/AssignJbi/test/CopygDayInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <gDayPart>
	<xsd_gDay>---25</xsd_gDay>
	<optional_gDay>---12</optional_gDay>
	<repeat_gDay>---12</repeat_gDay>
	<repeat_gDay>---01</repeat_gDay>
   </gDayPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
