driver-tests/bpelse/assign/AssignJbi/test/results/CopyhexBinaryInvoke/Actual_20130314144902_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <hexBinaryPart xmlns="urn:DataType" xmlns:msgns="urn:CopyDataTypeTNS">
      <xsd_hexBinary>41394644363445313243</xsd_hexBinary>
      <optional_hexBinary>41394644363445313243</optional_hexBinary>
      <repeat_hexBinary>41394644363445313243</repeat_hexBinary>
      <repeat_hexBinary>41394644363445313243</repeat_hexBinary>
    </hexBinaryPart>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>