driver-tests/bpelse/assign/AssignJbi/test/CopylongInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <longPart>
	<xsd_long>100</xsd_long>
	<optional_long>1000000000</optional_long>
	<repeat_long>1000000000</repeat_long>
	<repeat_long>10</repeat_long>
   </longPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
