driver-tests/bpelse/assign/AssignJbi/test/results/CopyintInvoke/Actual_20130318180003_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <intPart xmlns="urn:DataType" xmlns:msgns="urn:CopyDataTypeTNS">
      <xsd_int>100</xsd_int>
      <optional_int>0</optional_int>
      <repeat_int>0</repeat_int>
      <repeat_int>1</repeat_int>
    </intPart>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>