driver-tests/bpelse/assign/AssignJbi/test/CopyunsignedIntInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <unsignedIntPart>
	<xsd_unsignedInt>1000</xsd_unsignedInt>
	<optional_unsignedInt>444</optional_unsignedInt>
	<repeat_unsignedInt>444</repeat_unsignedInt>
	<repeat_unsignedInt>62</repeat_unsignedInt>
   </unsignedIntPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
