driver-tests/bpelse/assign/AssignJbi/test/CopydateInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <datePart>
	<xsd_date>2005-08-25</xsd_date>
        <optional_date>2006-01-02</optional_date>
	<repeat_date>2006-01-02</repeat_date>
	<repeat_date>2006-03-20</repeat_date>
   </datePart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>