driver-tests/bpelse/assign/AssignJbi/test/CopynegativeIntegerInvoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><negativeIntegerPart xmlns="urn:DataType"><xsd_negativeInteger>-100</xsd_negativeInteger><optional_negativeInteger>-1</optional_negativeInteger><repeat_negativeInteger>-1</repeat_negativeInteger><repeat_negativeInteger>-1000</repeat_negativeInteger></negativeIntegerPart></SOAP-ENV:Body></SOAP-ENV:Envelope>
