driver-tests/bpelse/assign/AssignJbi/test/CopyintegerInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <integerPart>
	<xsd_integer>1</xsd_integer>
	<optional_integer>200</optional_integer>
	<repeat_integer>200</repeat_integer>
	<repeat_integer>10</repeat_integer>
   </integerPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
