driver-tests/bpelse/assign/AssignJbi/test/results/CopygMonthDayInvoke/Actual_20130314144902_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <gMonthDayPart xmlns="urn:DataType" xmlns:msgns="urn:CopyDataTypeTNS">
      <xsd_gMonthDay>--8-25</xsd_gMonthDay>
      <optional_gMonthDay>--1-01</optional_gMonthDay>
      <repeat_gMonthDay>--1-01</repeat_gMonthDay>
      <repeat_gMonthDay>--10-31</repeat_gMonthDay>
    </gMonthDayPart>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>