driver-tests/bpelse/assign/AssignJbi/test/CopytimeInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <timePart>
	<xsd_time>16:00:00.000000</xsd_time>
	<optional_time>23:19:20.505000</optional_time>
	<repeat_time>23:19:20.505000</repeat_time>
	<repeat_time>1:01:01.000001</repeat_time>
   </timePart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
