driver-tests/bpelse/assign/AssignJbi/test/CopystringInvoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><stringPart xmlns="urn:DataType"><xsd_string>String</xsd_string><optional_string>Optional Data</optional_string><repeat_string>Repeating Data #1</repeat_string><repeat_string>Repeating Data #2</repeat_string></stringPart></SOAP-ENV:Body></SOAP-ENV:Envelope>