driver-tests/bpelse/assign/AssignJbi/test/CopydateTimeInvoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><dateTimePart xmlns="urn:DataType"><xsd_dateTime>2005-08-25T16:00:00.0Z</xsd_dateTime><optional_dateTime>2006-01-02T16:00:00.0Z</optional_dateTime><repeat_dateTime>2006-01-02T16:00:00.0Z</repeat_dateTime><repeat_dateTime>2006-03-20T16:00:00.0Z</repeat_dateTime></dateTimePart></SOAP-ENV:Body></SOAP-ENV:Envelope>
