driver-tests/bpelse/assign/AssignJbi/test/CopydurationInvoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><durationPart xmlns="urn:DataType"><xsd_duration>P2005Y8M25DT16H0M0S</xsd_duration><optional_duration>P2006Y2M27DT23H10M0S</optional_duration><repeat_duration>P2006Y2M27DT23H10M0S</repeat_duration><repeat_duration>P2006Y10M25DT2H23M59S</repeat_duration></durationPart></SOAP-ENV:Body></SOAP-ENV:Envelope>
